status/src/2022/0708.org
#+TITLE: 02 July 2022 - 08 July 2022

* MIT OCW
** 18.02 - Multiple Variable Calculus
*** Session 70
* Emergency Crystal Radio
** Have inductor selector - started desoldering
* POM 3D print
** fixed side holes in design
** initial POM config problematic - poor build platform adhesion
* Mill Controller #2
** PXE install of CentOS 6.10
*** Transferred ISO data to tuffy and verified checksums
* Alum Rock Data Center
** CentOS Stream 9 install kernel oopsed on boot
** Using CentOS 7 for now
** need to check alma, rocky, others? for suitability
* OLPC
** Needs ML1120 coin batteries to fix "invalid system date".
* Virtual Orchestra
** sfz file tests
*** Need tooling for sample trimming, loop support, normalization
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 9/6/2022
* Peter Kim
** Broadcom CSG Employee indicted for trade secret theft.
** United States v. Kim (5:21-cr-00438).
** Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)
** Sentencing 9/20/2022
