status/2022/0708.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>02 July 2022 - 08 July 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">02 July 2022 - 08 July 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org726d1f9">1. MIT OCW</a>
<ul>
<li><a href="#orgcf69635">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orge177054">1.1.1. Session 70</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8d53f23">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#orgef2ef6c">2.1. Have inductor selector - started desoldering</a></li>
</ul>
</li>
<li><a href="#org0597081">3. POM 3D print</a>
<ul>
<li><a href="#org69ad50e">3.1. fixed side holes in design</a></li>
<li><a href="#orgd8a2f18">3.2. initial POM config problematic - poor build platform adhesion</a></li>
</ul>
</li>
<li><a href="#orgb3256e4">4. Mill Controller #2</a>
<ul>
<li><a href="#orgfd37e27">4.1. PXE install of CentOS 6.10</a>
<ul>
<li><a href="#orgeb39568">4.1.1. Transferred ISO data to tuffy and verified checksums</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a0c09a">5. Alum Rock Data Center</a>
<ul>
<li><a href="#org29fcdc8">5.1. CentOS Stream 9 install kernel oopsed on boot</a></li>
<li><a href="#org63cdc01">5.2. Using CentOS 7 for now</a></li>
<li><a href="#orgcaf89b3">5.3. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#org377f6b7">6. OLPC</a>
<ul>
<li><a href="#org2a9fefc">6.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orge77512f">7. Virtual Orchestra</a>
<ul>
<li><a href="#org7ba85e7">7.1. sfz file tests</a>
<ul>
<li><a href="#orge61385b">7.1.1. Need tooling for sample trimming, loop support, normalization</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd686335">8. David Davies</a>
<ul>
<li><a href="#orgcfd3f08">8.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org2d6f4be">8.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orgb936f7b">8.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#org48a7207">9. Peter Kim</a>
<ul>
<li><a href="#orgaa3a615">9.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#orgd104226">9.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org7dca3ee">9.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#org4fd692b">9.4. Sentencing 9/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org726d1f9" class="outline-2">
<h2 id="org726d1f9"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcf69635" class="outline-3">
<h3 id="orgcf69635"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge177054" class="outline-4">
<h4 id="orge177054"><span class="section-number-4">1.1.1.</span> Session 70</h4>
</div>
</div>
</div>
<div id="outline-container-org8d53f23" class="outline-2">
<h2 id="org8d53f23"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgef2ef6c" class="outline-3">
<h3 id="orgef2ef6c"><span class="section-number-3">2.1.</span> Have inductor selector - started desoldering</h3>
</div>
</div>
<div id="outline-container-org0597081" class="outline-2">
<h2 id="org0597081"><span class="section-number-2">3.</span> POM 3D print</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org69ad50e" class="outline-3">
<h3 id="org69ad50e"><span class="section-number-3">3.1.</span> fixed side holes in design</h3>
</div>
<div id="outline-container-orgd8a2f18" class="outline-3">
<h3 id="orgd8a2f18"><span class="section-number-3">3.2.</span> initial POM config problematic - poor build platform adhesion</h3>
</div>
</div>
<div id="outline-container-orgb3256e4" class="outline-2">
<h2 id="orgb3256e4"><span class="section-number-2">4.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgfd37e27" class="outline-3">
<h3 id="orgfd37e27"><span class="section-number-3">4.1.</span> PXE install of CentOS 6.10</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgeb39568" class="outline-4">
<h4 id="orgeb39568"><span class="section-number-4">4.1.1.</span> Transferred ISO data to tuffy and verified checksums</h4>
</div>
</div>
</div>
<div id="outline-container-org7a0c09a" class="outline-2">
<h2 id="org7a0c09a"><span class="section-number-2">5.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org29fcdc8" class="outline-3">
<h3 id="org29fcdc8"><span class="section-number-3">5.1.</span> CentOS Stream 9 install kernel oopsed on boot</h3>
</div>
<div id="outline-container-org63cdc01" class="outline-3">
<h3 id="org63cdc01"><span class="section-number-3">5.2.</span> Using CentOS 7 for now</h3>
</div>
<div id="outline-container-orgcaf89b3" class="outline-3">
<h3 id="orgcaf89b3"><span class="section-number-3">5.3.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-org377f6b7" class="outline-2">
<h2 id="org377f6b7"><span class="section-number-2">6.</span> OLPC</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org2a9fefc" class="outline-3">
<h3 id="org2a9fefc"><span class="section-number-3">6.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orge77512f" class="outline-2">
<h2 id="orge77512f"><span class="section-number-2">7.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org7ba85e7" class="outline-3">
<h3 id="org7ba85e7"><span class="section-number-3">7.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orge61385b" class="outline-4">
<h4 id="orge61385b"><span class="section-number-4">7.1.1.</span> Need tooling for sample trimming, loop support, normalization</h4>
</div>
</div>
</div>
<div id="outline-container-orgd686335" class="outline-2">
<h2 id="orgd686335"><span class="section-number-2">8.</span> David Davies</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgcfd3f08" class="outline-3">
<h3 id="orgcfd3f08"><span class="section-number-3">8.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org2d6f4be" class="outline-3">
<h3 id="org2d6f4be"><span class="section-number-3">8.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orgb936f7b" class="outline-3">
<h3 id="orgb936f7b"><span class="section-number-3">8.3.</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-org48a7207" class="outline-2">
<h2 id="org48a7207"><span class="section-number-2">9.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgaa3a615" class="outline-3">
<h3 id="orgaa3a615"><span class="section-number-3">9.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-orgd104226" class="outline-3">
<h3 id="orgd104226"><span class="section-number-3">9.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org7dca3ee" class="outline-3">
<h3 id="org7dca3ee"><span class="section-number-3">9.3.</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-org4fd692b" class="outline-3">
<h3 id="org4fd692b"><span class="section-number-3">9.4.</span> Sentencing 9/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>